import os
from zoneinfo import ZoneInfo
from dataclasses import dataclass

# config.iniのパス
CONFIG_FILE_PATH = './config.ini'

# 地点と地点コードを紐づける
PLACE_CODE = {
    "北海道": 81,
    "東北"  : 82,
    "関東"  : 83,
    "北陸"  : 84,
    "中部"  : 85,
    "近畿"  : 86,
    "中国"  : 87,
    "四国"  : 88,
    "九州"  : 89,
    "沖縄"  : 90,
}


# 都道府県地点と地方地点コードを紐づける
# 概況図からそのまま持ってきただけ
PREF_CODE = {
    "北海道道北"    :"0102",
    "北海道道東"    :"0103",
    "北海道道央"    :"0104",
    "北海道道南"    :"0105",
    "青森県"        :"0201",
    "岩手県"        :"0301",
    "宮城県"        :"0401",
    "秋田県"        :"0501",
    "山形県"        :"0601",
    "福島県"        :"0701",
    "茨城県"        :"0801",
    "栃木県"        :"0901",
    "群馬県"        :"1001",
    "埼玉県"        :"1101",
    "千葉県"        :"1201",
    "東京都"        :"1301",
    "神奈川県"      :"1401",
    "新潟県"        :"1501",
    "富山県"        :"1601",
    "石川県"        :"1701",
    "福井県"        :"1801",
    "山梨県"        :"1901",
    "長野県"        :"2001",
    "岐阜県"        :"2101",
    "静岡県"        :"2201",
    "愛知県"        :"2301",
    "三重県"        :"2401",
    "滋賀県"        :"2501",
    "京都府"        :"2601",
    "大阪府"        :"2701",
    "兵庫県"        :"2801",
    "奈良県"        :"2901",
    "和歌山県"      :"3001",
    "鳥取県"        :"3101",
    "島根県"        :"3201",
    "岡山県"        :"3301",
    "広島県"        :"3401",
    "山口県"        :"3501",
    "徳島県"        :"3601",
    "香川県"        :"3701",
    "愛媛県"        :"3801",
    "高知県"        :"3901",
    "福岡県"        :"4001",
    "佐賀県"        :"4101",
    "長崎県"        :"4201",
    "熊本県"        :"4301",
    "大分県"        :"4401",
    "宮崎県"        :"4501",
    "鹿児島県"      :"4601",
    "沖縄県"        :"4701",
}

# ===== 設定 =====
TZ = ZoneInfo(os.getenv("TZ", "Asia/Tokyo"))
LOG_DIR = os.getenv("LOG_DIR", "./logs")

@dataclass
class MODE:
    timing = "timing"
    absolute = "absolute"
